{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v2.0.1", "userDefinedMetadata": {"signature": {"inputs": {"input:0": {"name": "input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "60"}, {"size": "4"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}}, "modelTopology": {"node": [{"name": "input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "60"}, {"size": "4"}]}}}}, {"name": "StatefulPartitionedCall/co2-predict2/L0Conv/conv1d/ExpandDims_1", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L1Conv/conv1d/ExpandDims_1", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}, {"size": "2"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L0Conv/conv1d/ExpandDims/dim", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L2Conv/conv1d/ExpandDims_1", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "4"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L1MaxPool/ExpandDims/dim", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/co2-predict2/Flatten/Const", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_8", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_10", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L0Conv/conv1d/ExpandDims", "op": "ExpandDims", "input": ["input", "StatefulPartitionedCall/co2-predict2/L0Conv/conv1d/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L0Conv/conv1d", "op": "Conv2D", "input": ["StatefulPartitionedCall/co2-predict2/L0Conv/conv1d/ExpandDims", "StatefulPartitionedCall/co2-predict2/L0Conv/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/co2-predict2/L0Conv/conv1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/co2-predict2/L0Conv/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L0Conv/Selu", "op": "Selu", "input": ["StatefulPartitionedCall/co2-predict2/L0Conv/conv1d/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L1Conv/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/co2-predict2/L0Conv/Selu", "StatefulPartitionedCall/co2-predict2/L0Conv/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L1Conv/conv1d", "op": "Conv2D", "input": ["StatefulPartitionedCall/co2-predict2/L1Conv/conv1d/ExpandDims", "StatefulPartitionedCall/co2-predict2/L1Conv/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/co2-predict2/L1Conv/conv1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/co2-predict2/L1Conv/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/co2-predict2/L1Conv/Selu", "op": "Selu", "input": ["StatefulPartitionedCall/co2-predict2/L1Conv/conv1d/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L1MaxPool/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/co2-predict2/L1Conv/Selu", "StatefulPartitionedCall/co2-predict2/L1MaxPool/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L1MaxPool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/co2-predict2/L1MaxPool/ExpandDims"], "attr": {"ksize": {"list": {"i": ["1", "4", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/co2-predict2/L1MaxPool/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/co2-predict2/L1MaxPool/MaxPool"], "attr": {"squeeze_dims": {"list": {"i": ["2"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L2Conv/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/co2-predict2/L1MaxPool/Squeeze", "StatefulPartitionedCall/co2-predict2/L0Conv/conv1d/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L2Conv/conv1d", "op": "Conv2D", "input": ["StatefulPartitionedCall/co2-predict2/L2Conv/conv1d/ExpandDims", "StatefulPartitionedCall/co2-predict2/L2Conv/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/co2-predict2/L2Conv/conv1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/co2-predict2/L2Conv/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/co2-predict2/L2Conv/Selu", "op": "Selu", "input": ["StatefulPartitionedCall/co2-predict2/L2Conv/conv1d/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L2MaxPool/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/co2-predict2/L2Conv/Selu", "StatefulPartitionedCall/co2-predict2/L1MaxPool/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L2MaxPool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/co2-predict2/L2MaxPool/ExpandDims"], "attr": {"ksize": {"list": {"i": ["1", "3", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "3", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/co2-predict2/L2MaxPool/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/co2-predict2/L2MaxPool/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["2"]}}}}, {"name": "StatefulPartitionedCall/co2-predict2/Flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/co2-predict2/L2MaxPool/Squeeze", "StatefulPartitionedCall/co2-predict2/Flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L3FC/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/co2-predict2/Flatten/Reshape", "Func/StatefulPartitionedCall/input/_8"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/co2-predict2/L3FC/Selu", "op": "Selu", "input": ["StatefulPartitionedCall/co2-predict2/L3FC/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/Output/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/co2-predict2/L3FC/Selu", "Func/StatefulPartitionedCall/input/_10"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/co2-predict2/Output/Selu", "op": "Selu", "input": ["StatefulPartitionedCall/co2-predict2/Output/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/co2-predict2/Output/Selu"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/co2-predict2/L0Conv/conv1d/ExpandDims_1", "shape": [1, 1, 4, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/co2-predict2/L1Conv/conv1d/ExpandDims_1", "shape": [1, 4, 2, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/co2-predict2/L0Conv/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/co2-predict2/L2Conv/conv1d/ExpandDims_1", "shape": [1, 3, 4, 6], "dtype": "float32"}, {"name": "StatefulPartitionedCall/co2-predict2/L1MaxPool/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/co2-predict2/Flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_8", "shape": [48, 4], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_10", "shape": [4, 1], "dtype": "float32"}]}]}