{"modelTopology":{"class_name":"Model","config":{"name":"co2-predict2","layers":[{"name":"Input","class_name":"InputLayer","config":{"batch_input_shape":[null,60,5],"dtype":"float32","sparse":false,"name":"Input"},"inbound_nodes":[]},{"name":"Feature1MinExtraction","class_name":"Conv1D","config":{"filters":4,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[4],"strides":[4],"padding":"valid","dilation_rate":[1],"activation":"selu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"Feature1MinExtraction","trainable":true},"inbound_nodes":[[["Input",0,0,{}]]]},{"name":"Gru1","class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"GRU","config":{"units":3,"activation":"selu","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"name":"gru_GRU1","trainable":true}},"name":"Gru1","trainable":true},"inbound_nodes":[[["Feature1MinExtraction",0,0,{}]]]},{"name":"Gru2","class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"GRU","config":{"units":3,"activation":"selu","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"name":"gru_GRU2","trainable":true}},"name":"Gru2","trainable":true},"inbound_nodes":[[["Gru1",0,0,{}]]]},{"name":"Output","class_name":"Dense","config":{"units":1,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"Output","trainable":true},"inbound_nodes":[[["Gru2",0,0,{}]]]}],"input_layers":[["Input",0,0]],"output_layers":[["Output",0,0]]},"keras_version":"tfjs-layers 1.7.4","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"Feature1MinExtraction/kernel","shape":[4,5,4],"dtype":"float32"},{"name":"Feature1MinExtraction/bias","shape":[4],"dtype":"float32"},{"name":"Gru1/forward_gru_GRU1/kernel","shape":[4,9],"dtype":"float32"},{"name":"Gru1/forward_gru_GRU1/recurrent_kernel","shape":[3,9],"dtype":"float32"},{"name":"Gru1/forward_gru_GRU1/bias","shape":[9],"dtype":"float32"},{"name":"Gru1/backward_gru_GRU1/kernel","shape":[4,9],"dtype":"float32"},{"name":"Gru1/backward_gru_GRU1/recurrent_kernel","shape":[3,9],"dtype":"float32"},{"name":"Gru1/backward_gru_GRU1/bias","shape":[9],"dtype":"float32"},{"name":"Gru2/forward_gru_GRU2/kernel","shape":[6,9],"dtype":"float32"},{"name":"Gru2/forward_gru_GRU2/recurrent_kernel","shape":[3,9],"dtype":"float32"},{"name":"Gru2/forward_gru_GRU2/bias","shape":[9],"dtype":"float32"},{"name":"Gru2/backward_gru_GRU2/kernel","shape":[6,9],"dtype":"float32"},{"name":"Gru2/backward_gru_GRU2/recurrent_kernel","shape":[3,9],"dtype":"float32"},{"name":"Gru2/backward_gru_GRU2/bias","shape":[9],"dtype":"float32"},{"name":"Output/kernel","shape":[6,1],"dtype":"float32"},{"name":"Output/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.7.4","convertedBy":null}