{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v2.0.1", "userDefinedMetadata": {"signature": {"inputs": {"input:0": {"name": "input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "60"}, {"size": "5"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}}, "modelTopology": {"node": [{"name": "input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "60"}, {"size": "5"}]}}}}, {"name": "StatefulPartitionedCall/co2-predict2/L0aConv/conv1d/ExpandDims_1", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "5"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L0bConv/conv1d/ExpandDims_1", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "6"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_5", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L0cConv/conv1d/ExpandDims_1", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "6"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_7", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L1Conv/conv1d/ExpandDims_1", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}, {"size": "2"}, {"size": "15"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_9", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "15"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L0aConv/conv1d/ExpandDims/dim", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_16", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L2Conv/conv1d/ExpandDims_1", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "15"}, {"size": "30"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_17", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_11", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "30"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/Flatten/Const", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_12", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "150"}, {"size": "15"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_13", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "15"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_14", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "15"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_15", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L0aConv/conv1d/ExpandDims", "op": "ExpandDims", "input": ["input", "StatefulPartitionedCall/co2-predict2/L0aConv/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L0aConv/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/co2-predict2/L0aConv/conv1d/ExpandDims", "StatefulPartitionedCall/co2-predict2/L0aConv/conv1d/ExpandDims_1", "Func/StatefulPartitionedCall/input/_3"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/co2-predict2/L0aConv/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/co2-predict2/L0aConv/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/co2-predict2/L0aConv/Selu", "op": "Selu", "input": ["StatefulPartitionedCall/co2-predict2/L0aConv/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L0bConv/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/co2-predict2/L0aConv/Selu", "StatefulPartitionedCall/co2-predict2/L0aConv/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L0bConv/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/co2-predict2/L0bConv/conv1d/ExpandDims", "StatefulPartitionedCall/co2-predict2/L0bConv/conv1d/ExpandDims_1", "Func/StatefulPartitionedCall/input/_5"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/co2-predict2/L0bConv/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/co2-predict2/L0bConv/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/co2-predict2/L0bConv/Selu", "op": "Selu", "input": ["StatefulPartitionedCall/co2-predict2/L0bConv/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L0cConv/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/co2-predict2/L0bConv/Selu", "StatefulPartitionedCall/co2-predict2/L0aConv/conv1d/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L0cConv/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/co2-predict2/L0cConv/conv1d/ExpandDims", "StatefulPartitionedCall/co2-predict2/L0cConv/conv1d/ExpandDims_1", "Func/StatefulPartitionedCall/input/_7"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/co2-predict2/L0cConv/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/co2-predict2/L0cConv/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L0cConv/Selu", "op": "Selu", "input": ["StatefulPartitionedCall/co2-predict2/L0cConv/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L1Conv/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/co2-predict2/L0cConv/Selu", "StatefulPartitionedCall/co2-predict2/L0aConv/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L1Conv/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/co2-predict2/L1Conv/conv1d/ExpandDims", "StatefulPartitionedCall/co2-predict2/L1Conv/conv1d/ExpandDims_1", "Func/StatefulPartitionedCall/input/_9"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "4", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/co2-predict2/L1Conv/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/co2-predict2/L1Conv/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/co2-predict2/L1Conv/Selu", "op": "Selu", "input": ["StatefulPartitionedCall/co2-predict2/L1Conv/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L2Conv/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/co2-predict2/L1Conv/Selu", "StatefulPartitionedCall/co2-predict2/L0aConv/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L2Conv/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/co2-predict2/L2Conv/conv1d/ExpandDims", "StatefulPartitionedCall/co2-predict2/L2Conv/conv1d/ExpandDims_1", "Func/StatefulPartitionedCall/input/_11"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "3", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/co2-predict2/L2Conv/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/co2-predict2/L2Conv/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L2Conv/Selu", "op": "Selu", "input": ["StatefulPartitionedCall/co2-predict2/L2Conv/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/Flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/co2-predict2/L2Conv/Selu", "StatefulPartitionedCall/co2-predict2/Flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L3FC/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/co2-predict2/Flatten/Reshape", "Func/StatefulPartitionedCall/input/_12", "Func/StatefulPartitionedCall/input/_13"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L3FC/Selu", "op": "Selu", "input": ["StatefulPartitionedCall/co2-predict2/L3FC/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L4FC/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/co2-predict2/L3FC/Selu", "Func/StatefulPartitionedCall/input/_14", "Func/StatefulPartitionedCall/input/_15"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L4FC/Selu", "op": "Selu", "input": ["StatefulPartitionedCall/co2-predict2/L4FC/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/Output/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/co2-predict2/L4FC/Selu", "Func/StatefulPartitionedCall/input/_16", "Func/StatefulPartitionedCall/input/_17"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/co2-predict2/Output/Selu", "op": "Selu", "input": ["StatefulPartitionedCall/co2-predict2/Output/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/co2-predict2/Output/Selu"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/co2-predict2/L0aConv/conv1d/ExpandDims_1", "shape": [1, 1, 5, 6], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_3", "shape": [6], "dtype": "float32"}, {"name": "StatefulPartitionedCall/co2-predict2/L0bConv/conv1d/ExpandDims_1", "shape": [1, 1, 6, 6], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_5", "shape": [6], "dtype": "float32"}, {"name": "StatefulPartitionedCall/co2-predict2/L0cConv/conv1d/ExpandDims_1", "shape": [1, 1, 6, 2], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_7", "shape": [2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/co2-predict2/L1Conv/conv1d/ExpandDims_1", "shape": [1, 4, 2, 15], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_9", "shape": [15], "dtype": "float32"}, {"name": "StatefulPartitionedCall/co2-predict2/L0aConv/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_16", "shape": [4, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/co2-predict2/L2Conv/conv1d/ExpandDims_1", "shape": [1, 3, 15, 30], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_17", "shape": [1], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_11", "shape": [30], "dtype": "float32"}, {"name": "StatefulPartitionedCall/co2-predict2/Flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_12", "shape": [150, 15], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_13", "shape": [15], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_14", "shape": [15, 4], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_15", "shape": [4], "dtype": "float32"}]}]}