{"modelTopology":{"class_name":"Model","config":{"name":"co2-predict2","layers":[{"name":"Input","class_name":"InputLayer","config":{"batch_input_shape":[null,60,4],"dtype":"float32","sparse":false,"name":"Input"},"inbound_nodes":[]},{"name":"InputPhCompression","class_name":"Conv1D","config":{"filters":1,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1],"strides":[1],"padding":"valid","dilation_rate":[1],"activation":"selu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"InputPhCompression","trainable":true},"inbound_nodes":[[["Input",0,0,{}]]]},{"name":"Last5MinLayer","class_name":"AkDropTimeseriesLayer","config":{"drop_head":40,"drop_tail":0,"name":"Last5MinLayer","trainable":true},"inbound_nodes":[[["Input",0,0,{}]]]},{"name":"Avg10Min","class_name":"AveragePooling1D","config":{"pool_size":[40],"padding":"valid","strides":[4],"name":"Avg10Min","trainable":true},"inbound_nodes":[[["InputPhCompression",0,0,{}]]]},{"name":"Feature1MinExtraction","class_name":"Conv1D","config":{"filters":2,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[4],"strides":[4],"padding":"valid","dilation_rate":[1],"activation":"selu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"Feature1MinExtraction","trainable":true},"inbound_nodes":[[["Last5MinLayer",0,0,{}]]]},{"name":"Gru10Min","class_name":"GRU","config":{"units":3,"activation":"selu","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"name":"Gru10Min","trainable":true},"inbound_nodes":[[["Avg10Min",0,0,{}]]]},{"name":"Gru1Min","class_name":"GRU","config":{"units":3,"activation":"selu","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"name":"Gru1Min","trainable":true},"inbound_nodes":[[["Feature1MinExtraction",0,0,{}]]]},{"name":"Concat","class_name":"Concatenate","config":{"axis":-1,"name":"Concat","trainable":true},"inbound_nodes":[[["Gru10Min",0,0,{}],["Gru1Min",0,0,{}]]]},{"name":"Output","class_name":"Dense","config":{"units":1,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"Output","trainable":true},"inbound_nodes":[[["Concat",0,0,{}]]]}],"input_layers":[["Input",0,0]],"output_layers":[["Output",0,0]]},"keras_version":"tfjs-layers 1.7.4","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"InputPhCompression/kernel","shape":[1,4,1],"dtype":"float32"},{"name":"InputPhCompression/bias","shape":[1],"dtype":"float32"},{"name":"Feature1MinExtraction/kernel","shape":[4,4,2],"dtype":"float32"},{"name":"Feature1MinExtraction/bias","shape":[2],"dtype":"float32"},{"name":"Gru10Min/kernel","shape":[1,9],"dtype":"float32"},{"name":"Gru10Min/recurrent_kernel","shape":[3,9],"dtype":"float32"},{"name":"Gru10Min/bias","shape":[9],"dtype":"float32"},{"name":"Gru1Min/kernel","shape":[2,9],"dtype":"float32"},{"name":"Gru1Min/recurrent_kernel","shape":[3,9],"dtype":"float32"},{"name":"Gru1Min/bias","shape":[9],"dtype":"float32"},{"name":"Output/kernel","shape":[6,1],"dtype":"float32"},{"name":"Output/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.7.4","convertedBy":null}