{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v2.0.1", "userDefinedMetadata": {"signature": {"inputs": {"input:0": {"name": "input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "60"}, {"size": "4"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}}, "modelTopology": {"node": [{"name": "input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "60"}, {"size": "4"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L0Conv/conv1d/ExpandDims_1", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L1Conv/conv1d/ExpandDims_1", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}, {"size": "2"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_5", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L0Conv/conv1d/ExpandDims/dim", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_11", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L2Conv/conv1d/ExpandDims_1", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "10"}, {"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_7", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L1MaxPool/ExpandDims/dim", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/co2-predict2/Flatten/Const", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_8", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_9", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_10", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L0Conv/conv1d/ExpandDims", "op": "ExpandDims", "input": ["input", "StatefulPartitionedCall/co2-predict2/L0Conv/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L0Conv/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/co2-predict2/L0Conv/conv1d/ExpandDims", "StatefulPartitionedCall/co2-predict2/L0Conv/conv1d/ExpandDims_1", "Func/StatefulPartitionedCall/input/_3"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/co2-predict2/L0Conv/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/co2-predict2/L0Conv/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/co2-predict2/L0Conv/Selu", "op": "Selu", "input": ["StatefulPartitionedCall/co2-predict2/L0Conv/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L1Conv/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/co2-predict2/L0Conv/Selu", "StatefulPartitionedCall/co2-predict2/L0Conv/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L1Conv/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/co2-predict2/L1Conv/conv1d/ExpandDims", "StatefulPartitionedCall/co2-predict2/L1Conv/conv1d/ExpandDims_1", "Func/StatefulPartitionedCall/input/_5"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/co2-predict2/L1Conv/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/co2-predict2/L1Conv/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/co2-predict2/L1Conv/Selu", "op": "Selu", "input": ["StatefulPartitionedCall/co2-predict2/L1Conv/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L1MaxPool/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/co2-predict2/L1Conv/Selu", "StatefulPartitionedCall/co2-predict2/L1MaxPool/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L1MaxPool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/co2-predict2/L1MaxPool/ExpandDims"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "4", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/co2-predict2/L1MaxPool/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/co2-predict2/L1MaxPool/MaxPool"], "attr": {"squeeze_dims": {"list": {"i": ["2"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L2Conv/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/co2-predict2/L1MaxPool/Squeeze", "StatefulPartitionedCall/co2-predict2/L0Conv/conv1d/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L2Conv/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/co2-predict2/L2Conv/conv1d/ExpandDims", "StatefulPartitionedCall/co2-predict2/L2Conv/conv1d/ExpandDims_1", "Func/StatefulPartitionedCall/input/_7"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/co2-predict2/L2Conv/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/co2-predict2/L2Conv/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/co2-predict2/L2Conv/Selu", "op": "Selu", "input": ["StatefulPartitionedCall/co2-predict2/L2Conv/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L2MaxPool/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/co2-predict2/L2Conv/Selu", "StatefulPartitionedCall/co2-predict2/L1MaxPool/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L2MaxPool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/co2-predict2/L2MaxPool/ExpandDims"], "attr": {"ksize": {"list": {"i": ["1", "3", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "3", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/co2-predict2/L2MaxPool/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/co2-predict2/L2MaxPool/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["2"]}}}}, {"name": "StatefulPartitionedCall/co2-predict2/Flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/co2-predict2/L2MaxPool/Squeeze", "StatefulPartitionedCall/co2-predict2/Flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/co2-predict2/L3FC/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/co2-predict2/Flatten/Reshape", "Func/StatefulPartitionedCall/input/_8", "Func/StatefulPartitionedCall/input/_9"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/co2-predict2/L3FC/Selu", "op": "Selu", "input": ["StatefulPartitionedCall/co2-predict2/L3FC/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/Output/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/co2-predict2/L3FC/Selu", "Func/StatefulPartitionedCall/input/_10", "Func/StatefulPartitionedCall/input/_11"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/co2-predict2/Output/Selu", "op": "Selu", "input": ["StatefulPartitionedCall/co2-predict2/Output/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/co2-predict2/Output/Selu"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/co2-predict2/L0Conv/conv1d/ExpandDims_1", "shape": [1, 1, 4, 2], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_3", "shape": [2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/co2-predict2/L1Conv/conv1d/ExpandDims_1", "shape": [1, 4, 2, 10], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_5", "shape": [10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/co2-predict2/L0Conv/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_11", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/co2-predict2/L2Conv/conv1d/ExpandDims_1", "shape": [1, 3, 10, 20], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_7", "shape": [20], "dtype": "float32"}, {"name": "StatefulPartitionedCall/co2-predict2/L1MaxPool/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/co2-predict2/Flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_8", "shape": [160, 4], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_9", "shape": [4], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_10", "shape": [4, 1], "dtype": "float32"}]}]}